netsuite/netsuite-connector/netsuite-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/netsuite/api_getItemAvailability_optional.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:urn="urn:messages_2014_1.platform.webservices.netsuite.com" 
xmlns:urn1="urn:core_2014_1.platform.webservices.netsuite.com">
   <soapenv:Header>
      <urn:preferences>
         <urn:warningAsError>true</urn:warningAsError>
         <urn:disableMandatoryCustomFieldValidation>false</urn:disableMandatoryCustomFieldValidation>
         <urn:disableSystemNotesForCustomFields>true</urn:disableSystemNotesForCustomFields>
         <urn:ignoreReadOnlyFields>true</urn:ignoreReadOnlyFields>
      </urn:preferences>
      <urn:partnerInfo>
         <urn:partnerId></urn:partnerId>
      </urn:partnerInfo>
      <urn:applicationInfo>
         <urn:applicationId></urn:applicationId>
      </urn:applicationInfo>
      <urn:passport>
            <urn1:email>%s(email)</urn1:email>
            <urn1:password>%s(password)</urn1:password>
            <urn1:account>%s(account)</urn1:account>
         <urn1:role>
            <urn1:name></urn1:name>
         </urn1:role>
      </urn:passport>
   </soapenv:Header>
   <soapenv:Body>
      <urn:getItemAvailability>
         <urn:itemAvailabilityFilter>
            <urn1:item>
               <urn1:recordRef internalId="%s(getItemAvailabilityInventoryItemInternalId)"  type="inventoryItem">
               </urn1:recordRef>
            </urn1:item>
          <urn1:lastQtyAvailableChange>%s(getItemAvailabilityLastQtyAvailableChange)</urn1:lastQtyAvailableChange>
         </urn:itemAvailabilityFilter>
      </urn:getItemAvailability>
   </soapenv:Body>
</soapenv:Envelope>